_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РеестрДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РеестрДоговоров</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_ДанныеРеестраДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыСогласованияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Договора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектСтроительства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПервоначальнаяСуммаПоДоговоруСУчетомНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущаяСуммаПоДоговоруСУчетомНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРасчетаПБУ_2_2008</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРасчетаПБУ_2_2008</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаВыручкиПБУ_2_2008</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_СпособРасчетаВыручкиПоПБУ_2_2008</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/InformationRegisters/УСОERP_ДанныеРеестраДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>УСОERP_ДанныеРеестраДоговоров</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПервоначальнаяСуммаПоДоговоруСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСуммаПоДоговоруСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НачалоРасчетаПБУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеРасчетаПБУ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаВыручкиПоПБУ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СпособРасчетаВыручкиПоПБУ_2_2008</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_СтатусыСогласованияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_СтатусыСогласованияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РеестрДоговоров/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область Прочее

Функция ПроверитьНаИзменеияВРегистреДанныеРеестраДоговоров(ПараметрыПоиска)
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ЭтотОбъект.Дата);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Договор", ПараметрыПоиска.Договор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.Организация,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.ОбъектСтроительства,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.Контрагент,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.ПервоначальнаяСуммаПоДоговоруСНДС,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.ТекущаяСуммаПоДоговоруСНДС,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.НачалоРасчетаПБУ,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.ОкончаниеРасчетаПБУ,
	               |	УСОERP_ДанныеРеестраДоговоровСрезПоследних.СпособРасчетаВыручкиПоПБУ
	               |ИЗ
	               |	РегистрСведений.УСОERP_ДанныеРеестраДоговоров.СрезПоследних(
	               |			&Дата,
	               |			Договор = &Договор
	               |				И Организация = &Организация) КАК УСОERP_ДанныеРеестраДоговоровСрезПоследних";
	РезультатПоиска = Запрос.Выполнить().Выбрать();			   
	Если РезультатПоиска.Следующий() Тогда
		Если РезультатПоиска.ОбъектСтроительства = ПараметрыПоиска.ОбъектСтроительства
			И РезультатПоиска.ПервоначальнаяСуммаПоДоговоруСНДС = ПараметрыПоиска.ПервоначальнаяСуммаПоДоговоруСУчетомНДС
			И РезультатПоиска.ТекущаяСуммаПоДоговоруСНДС = ПараметрыПоиска.ТекущаяСуммаПоДоговоруСУчетомНДС
			И РезультатПоиска.НачалоРасчетаПБУ = ПараметрыПоиска.НачалоРасчетаПБУ_2_2008
			И РезультатПоиска.ОкончаниеРасчетаПБУ = ПараметрыПоиска.ОкончаниеРасчетаПБУ_2_2008
			И РезультатПоиска.СпособРасчетаВыручкиПоПБУ = ПараметрыПоиска.СпособРасчетаВыручкиПБУ_2_2008 
			Тогда
				Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Истина;
КонецФункции	

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЭтотОбъект.СостояниеСогласования = Перечисления.УСОERP_СтатусыСогласованияДокументов.Согласован Тогда
		Для каждого стрДоговор из ЭтотОбъект.Договора Цикл
			//ПараметрыПроверки = Новый Структура;
			//ПараметрыПроверки.Вставить("Договор", стрДоговор.Договор);
			//ПараметрыПроверки.Вставить("Организация", ЭтотОбъект.Организация);
			//ПараметрыПроверки.Вставить("ОбъектСтроительства", стрДоговор.ОбъектСтроительства);
			//ПараметрыПроверки.Вставить("Контрагент", стрДоговор.Заказчик);
			//ПараметрыПроверки.Вставить("ПервоначальнаяСуммаПоДоговоруСНДС
			Если ПроверитьНаИзменеияВРегистреДанныеРеестраДоговоров(стрДоговор)Тогда
				
				Движения.УСОERP_ДанныеРеестраДоговоров.Записывать = Истина;
				
				зРеестраДоговоров = Движения.УСОERP_ДанныеРеестраДоговоров.Добавить();
				
				зРеестраДоговоров.Период							= ЭтотОбъект.Дата;
				зРеестраДоговоров.Регистратор						= Ссылка;
				зРеестраДоговоров.Договор 							= стрДоговор.Договор;
				зРеестраДоговоров.Контрагент    					= стрДоговор.Заказчик;
				зРеестраДоговоров.ОбъектСтроительства				= стрДоговор.ОбъектСтроительства;
				зРеестраДоговоров.НачалоРасчетаПБУ					= стрДоговор.НачалоРасчетаПБУ_2_2008;
				зРеестраДоговоров.ОкончаниеРасчетаПБУ				= стрДоговор.ОкончаниеРасчетаПБУ_2_2008;
				зРеестраДоговоров.Организация						= ЭтотОбъект.Организация;
				зРеестраДоговоров.ПервоначальнаяСуммаПоДоговоруСНДС	= стрДоговор.ПервоначальнаяСуммаПоДоговоруСУчетомНДС;
				зРеестраДоговоров.ТекущаяСуммаПоДоговоруСНДС		= стрДоговор.ТекущаяСуммаПоДоговоруСУчетомНДС;
				зРеестраДоговоров.СпособРасчетаВыручкиПоПБУ			= стрДоговор.СпособРасчетаВыручкиПБУ_2_2008;
				
			КонецЕсли;	
		КонецЦикла;
		//Движения.УСОERP_ДанныеРеестраДоговоров.Записать();
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
